// Напишите программу для нахождения максимального числа ягод, 
// которое может собрать за один заход собирающий модуль,
// находясь перед некоторым кустом заданной во входном файле грядки.

Console.WriteLine("Hello, World!");
